######################################################################
# [ファイル名]
#  EnvFile.ps1
#
# [概要]
#  Notification Hubs の環境構築用の環境設定ファイル。
#  SetNotificationHubs.ps1 で使用する。
#
# [禁止事項]
#  ユーザ変更不可項目の変更。
#  
#
######################################################################

######################################################################
# ユーザ変更項目
######################################################################
######################################################################
# 必須設定
######################################################################
# Azure サブスクリプション ID
$AzureSubscriptionID = "";

# リソースグループ名
$ResourceGroupName = "";

# 各資産作成場所
$Location = "";

# Notification Hubs のネームスペース名
$HubNamespace = "";

# Notification Hubs のハブ名
$HubName = "";

# App Service プラン名
$AppServicePlanName = "";

# Web App 名
$WebAppName = "";

######################################################################
# 任意設定
######################################################################
######################################################################
# Google(GCM) 設定項目
######################################################################
# Google(GCM) のAPI キー
$GcmApiKey = "";

######################################################################
# APNs 設定項目
######################################################################
# エンドポイント(gateway.push.apple.com か gateway.sandbox.push.apple.comを設定)
$ApnsEndpoint = "";

# Apple 証明書要求ファイル名
$ApnsCertificateFile = "";

# Apple 証明書要求ファイル作成時のパスワード
$ApnsCertificateKey = "";

######################################################################
# ユーザ変更不可項目
######################################################################
# Notification Hubs 作成時の入力 json ファイル(変更不可)
$HubInputFile = "\hubinputfile.json";

# Notification Hubs 作成用json型データ(変更不可)
$HubJsonData = '{"name": "' + $HubName + '",  "Location": "' + $Location + '",  "Properties": {  }}'

# Microsoft.Azure.NotificationHubs 格納フォルダ(変更不可)
$PackagesFolder = "\packages";

# Microsoft.Azure.NotificationHubs のモジュール名(変更不可)
$NotificationHubsDll = "Microsoft.Azure.NotificationHubs.dll";

# スリープ時間
$SleepTime = 10;
